<?php
/* PHP.net*/
$x = 10;
$y = 0;
$b_1 = $x > 10;
$b_2 = $y == 0;
echo "x = $x; y = $y <br />";
echo "x>10 = $b_1; b=0 = $b_2";

$b_1 = true;
$b_2 = false;
echo "<br />";
echo "b_1 = $b_1; b_2 = $b_2 <br />";
echo "Отрицание b_1=".!$b_1. '<br />';
echo "Логичисгое сложение b_1 ИЛИ b_2=".($b_1 || $b_2).'<br />';
echo "Логичисгое умножение  b_1 И b_2=".($b_1 && $b_2).'<br />';
echo "Исключабщее или b_1 ИСКЛ ИЛИ b_2=".($b_1 xor $b_2).'<br />';

$x = 5;
$y = '5';
echo 'Результат проверки на равенство x и y ='.($x == $y).'<br />';
echo 'Результат проверки на эквивалентсоть x и y ='.($x === $y).'<br />';
?>
